Feature: Calculator tests

  @Test
  Scenario Outline: Positive Test Suit (posTest001-posTest036)
    Given Пользователь запускает калькулятор
    Then Вводит корректные данные в поле «Делимое А:» '<a>'
    And Вводит корректные данные в поле «Делитель В:» '<b>'
    And Нажимает на кнопку «=»
    Then Он видит результат деления '<c>'
    Examples:
  |  a    | b   |     c |
  |24.75  |4.5  |    5.5|
  |24.75  |-4.5 |   -5.5|
  |24.75  |	3   |	8.25|
  |24.75  |	-3	|  -8.25|
  |-24.75 |	4.5 |	-5.5|
  |-24.75 |	-4.5|	 5.5|
  |-24.75 |	3	|  -8.25|
  |-24.75 |	-3  |	8.25|
  |45	  |4.5  |	10.0|
  |45	  |-4.5 |  -10.0|
  |45     |	3   |   15.0|
  |45	  |-3	|  -15.0|
  |-45    |	4.5 |  -10.0|
  |-45    |	-4.5|	10.0|
  |-45    |	3   |  -15.0|
  |-45    |	-3  |	15.0|
  |0      |	4.5 |	0.0 |
  |0      |	-4.5|	 0.0|
  |0      |	3   |	0.0 |
  |0      |-3   |  	 0.0|
  |1.0e7  |	1.0e7|	1.0 |
  |1.0e7  |	-1.0e7|	-1.0|
  |1.0e7  |	1.0E7 |	1.0 |
  |1.0e7  |	-1.0E7|	-1.0|
  |-1.0e7 |	1.0e7 |	-1.0|
  |-1.0e7 |	-1.0e7|	1.0 |
  |-1.0e7 |	1.0E7 |	-1.0|
  |-1.0e7 |	-1.0E7|	1.0 |
  |1.0E7  |	1.0e7 |	1.0 |
  |1.0E7  |	-1.0e7|	-1.0|
  |1.0E7  |	1.0E7 |	1.0 |
  |1.0E7  |	-1.0E7|	-1.0|
  |-1.0E7 |	1.0e7 |	-1.0|
  |-1.0E7 |	-1.0e7|	1.0 |
  |-1.0E7 |	1.0E7 |	-1.0|
  |-1.0E7 |	-1.0E7|	1.0 |
